In [3]:
import pandas as pd

In [7]:
d=pd.DataFrame({'name':['ajd','cjdfj','djg','bfkfl','ejff','gkfj','zffk'],'age':[10,50,5,6,2,45,5]})
d

    name  age
0    ajd   10
1  cjdfj   50
2    djg    5
3  bfkfl    6
4   ejff    2
5   gkfj   45
6   zffk    5

In [11]:
d['class']=pd.Series([1,2,8,4,5,6,7])

In [12]:
d

    name  age  class
0    ajd   10      1
1  cjdfj   50      2
2    djg    5      8
3  bfkfl    6      4
4   ejff    2      5
5   gkfj   45      6
6   zffk    5      7

In [14]:
d.loc[3]["class"]

4

In [15]:
d.iloc[3][1]

6

In [22]:
d.rename(columns={"name":"NAME","age":"AGE"})

    NAME  AGE  class
0    ajd   10      1
1  cjdfj   50      2
2    djg    5      8
3  bfkfl    6      4
4   ejff    2      5
5   gkfj   45      6
6   zffk    5      7

In [24]:
d.drop([2],axis=0)

    name  age  class
0    ajd   10      1
1  cjdfj   50      2
3  bfkfl    6      4
4   ejff    2      5
5   gkfj   45      6
6   zffk    5      7

In [25]:
d.drop("class",axis=1)

    name  age
0    ajd   10
1  cjdfj   50
2    djg    5
3  bfkfl    6
4   ejff    2
5   gkfj   45
6   zffk    5

In [26]:
d.set_index("age",inplace=True)

In [27]:
d

      name  class
age
10     ajd      1
50   cjdfj      2
5      djg      8
6    bfkfl      4
2     ejff      5
45    gkfj      6
5     zffk      7

In [28]:
d.reset_index(inplace=True)

In [29]:
d

   age   name  class
0   10    ajd      1
1   50  cjdfj      2
2    5    djg      8
3    6  bfkfl      4
4    2   ejff      5
5   45   gkfj      6
6    5   zffk      7

In [30]:
d.sort_values("name")

   age   name  class
0   10    ajd      1
3    6  bfkfl      4
1   50  cjdfj      2
2    5    djg      8
4    2   ejff      5
5   45   gkfj      6
6    5   zffk      7

In [31]:
d[d.age==7]

Empty DataFrame
Columns: [age, name, class]
Index: []

In [32]:
d.age==7

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: age, dtype: bool